Revit 2027 API
ParameterTypeId.CurtaingridUseCurveDist Property
 "Use Curve Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurtaingridUseCurveDist { get; }
Public Shared ReadOnly Property CurtaingridUseCurveDist As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurtaingridUseCurveDist {
	ForgeTypeId^ get ();
}
static member CurtaingridUseCurveDist : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace